tap "anomalyco/tap"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "surge-downloader/tap"
brew "astro"
brew "bandwhich"
brew "bat"
brew "brew-cask-completion"
brew "btop"
brew "cmake"
brew "cmatrix"
brew "docker"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glow"
brew "gping"
brew "grex"
brew "python@3.14"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "openjdk@21"
brew "kotlin-language-server"
brew "ktlint"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "mysql"
brew "nano"
brew "neovim"
brew "ninja"
brew "nload"
brew "node"
brew "node@20"
brew "oh-my-posh"
brew "pipx"
brew "postgresql@14", restart_service: :changed
brew "potrace"
brew "procs"
brew "python-tk@3.14"
brew "python@3.13"
brew "ripgrep"
brew "sparse"
brew "sphinx-doc"
brew "starship"
brew "stow"
brew "stylua"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tpm"
brew "tree"
brew "trippy"
brew "tty-clock"
brew "w3m"
brew "wireshark"
brew "yazi"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "felixkratz/formulae/borders"
cask "nikitabobko/tap/aerospace"
cask "bruno"
cask "claude"
cask "codex"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "httpie-desktop"
cask "karabiner-elements"
cask "kitty"
cask "mysteriumdark"
cask "raycast"
cask "surge-downloader/tap/surge"
cask "temurin"
cask "temurin@11"
cask "visual-studio-code"
cask "wireshark-app"
cask "zed"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "nordic-semiconductor.nrf-connect"
vscode "nordic-semiconductor.nrf-connect-extension-pack"
vscode "nordic-semiconductor.nrf-devicetree"
vscode "nordic-semiconductor.nrf-kconfig"
vscode "nordic-semiconductor.nrf-terminal"
vscode "redhat.vscode-yaml"
vscode "trond-snekvik.gnu-mapfiles"
